music_app/app/controllers/albums_controller.rb

  def new
    @band = Band.find_by(id: params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    # @band = Band.find(params[:band_id])

    # @album.band_id = @band.id
    # album.band = @band

    if @album.save
---
INSERT INTO "albums" ("title", "year", "live?", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "POD RACING IS COOL"], ["year", 1420], ["live?", true], ["band_id", 2], ["created_at", "2018-11-16 00:57:29.501963"], ["updated_at", "2018-11-16 00:57:29.501963"]]

  def destroy
    album = Album.find_by(id: params[:id])
    band = album.band
    album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 5]]