music_app/app/controllers/bands_controller.rb

  def update
    @band = Band.find_by(id: params[:id])

    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Jammers5"], ["updated_at", "2018-11-15 22:58:50.059858"], ["id", 1]]